Repository: oussamamohamed/POS_SK
Catalog: ios/RestaurantPOS/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr

# admin.activate
source: Activate
ar: تفعيل
fr: Activer

# admin.active_toggle
source: Active
ar: نشط
fr: Actif

# admin.address_label
source: Address
ar: العنوان
fr: Adresse

# admin.all_families_toggle
source: All families
ar: كل الفئات
fr: Toutes les familles

# admin.appearance_dark
source: Service (dark)
ar: الخدمة (داكن)
fr: Service (sombre)

# admin.appearance_light
source: Day (light)
ar: النهار (فاتح)
fr: Jour (clair)

# admin.appearance_section
source: Appearance
ar: المظهر
fr: Apparence

# admin.appearance_system
source: iPad setting
ar: إعداد iPad
fr: Réglage de l'iPad

# admin.apply_button
source: Apply
ar: تطبيق
fr: Appliquer

# admin.cash_drawer_badge
source: Drawer
ar: الدرج
fr: Tiroir

# admin.category_label
source: Family
ar: الفئة
fr: Famille

# admin.category_name_placeholder
source: Family name
ar: اسم الفئة
fr: Nom de la famille

# admin.category_station_label
source: Preparation station
ar: محطة التحضير
fr: Poste de préparation

# admin.change_server_button
source: Change server…
ar: تغيير الخادم…
fr: Changer de serveur…

# admin.color_label
source: Color
ar: اللون
fr: Couleur

# admin.columns_stepper %lld
source: Columns %lld
ar: الأعمدة %lld
fr: Colonnes %lld

# admin.connected_label
source: Connected
ar: متصل
fr: Connecté

# admin.custom_label_placeholder
source: Custom label (optional)
ar: تسمية مخصصة (اختياري)
fr: Libellé personnalisé (facultatif)

# admin.deactivate
source: Deactivate
ar: تعطيل
fr: Désactiver

# admin.deactivated_badge
source: Deactivated
ar: معطّلة
fr: Désactivée

# admin.demo_data_label
source: Demo data
ar: بيانات تجريبية
fr: Données de démonstration

# admin.description_placeholder
source: Description
ar: الوصف

# admin.disconnected_label
source: Disconnected
ar: غير متصل
fr: Déconnecté

# admin.edit_category
source: Edit family
ar: تعديل الفئة
fr: Modifier la famille

# admin.edit_printer
source: Edit printer
ar: تعديل الطابعة
fr: Modifier l'imprimante

# admin.edit_product
source: Edit item
ar: تعديل الصنف
fr: Modifier l'article

# admin.edit_staff
source: Edit employee
ar: تعديل الموظف
fr: Modifier l'employé

# admin.empty_slot_label
source: (Empty slot)
ar: (خانة فارغة)
fr: (Case vide)

# admin.filter_all
source: All
ar: الكل
fr: Tout

# admin.force_sync_button
source: Force sync
ar: فرض المزامنة
fr: Forcer la synchronisation

# admin.full_name_placeholder
source: Full name
ar: الاسم الكامل
fr: Nom complet

# admin.grid_format %lld%lld%lld
source: Format %lld×%lld · v%lld
ar: التنسيق %lld×%lld · v%lld

# admin.grid_products_section
source: Items — drag onto a slot
ar: الأصناف — اسحب إلى خانة
fr: Articles — glissez sur une case

# admin.hh_applies_takeaway_toggle
source: Also applies to takeaway
ar: يُطبَّق أيضًا على السفري
fr: S'applique aussi à la vente à emporter

# admin.hh_apply_families %lld
source: Apply to %lld famili(es)
ar: تطبيق على %lld فئة
fr: Appliquer aux %lld famille(s)

# admin.hh_apply_products %lld
source: Apply to %lld item(s)
ar: تطبيق على %lld صنف
fr: Appliquer aux %lld article(s)

# admin.hh_create_button
source: Create
ar: إنشاء
fr: Créer

# admin.hh_days_section
source: Days
ar: الأيام
fr: Jours

# admin.hh_delete_rules %lld
source: Delete %lld rule(s)
ar: حذف %lld قاعدة
fr: Supprimer %lld règle(s)

# admin.hh_dine_in_only
source: dine-in only
ar: في المطعم فقط
fr: sur place uniquement

# admin.hh_discount_label
source: Discount
ar: الخصم
fr: Remise

# admin.hh_discount_percent_option
source: Discount (%)
ar: خصم (%)
fr: Remise (%)

# admin.hh_end_label
source: End
ar: النهاية
fr: Fin

# admin.hh_family_item_count %lld
source: %lld item(s)
ar: %lld صنف
fr: %lld article(s)

# admin.hh_fixed_price_option
source: Fixed price (€)
ar: سعر ثابت (€)
fr: Prix fixe (€)

# admin.hh_hours_section
source: Hours
ar: الأوقات
fr: Horaires

# admin.hh_new_schedule_title
source: New Happy Hour schedule
ar: فترة Happy Hour جديدة
fr: Nouvelle plage Happy Hour

# admin.hh_no_schedule_message
source: Create a Happy Hour schedule to configure rates.
ar: أنشئ فترة Happy Hour لإعداد الأسعار.
fr: Créez une plage Happy Hour pour configurer des tarifs.

# admin.hh_no_schedule_title
source: No schedule selected
ar: لم يتم اختيار أي فترة
fr: Aucune plage sélectionnée

# admin.hh_normal_price %@
source: Normal price ⁦%@⁩
ar: السعر العادي ⁦%@⁩
fr: Prix normal ⁦%@⁩

# admin.hh_price_mode_label
source: Mode
ar: الوضع

# admin.hh_priority_stepper %lld
source: Priority %lld
ar: الأولوية %lld
fr: Priorité %lld

# admin.hh_rules_priority %lld %lld
source: %lld rule(s) · priority %lld
ar: %lld قاعدة · الأولوية %lld
fr: %lld règle(s) · priorité %lld

# admin.hh_schedule_name_placeholder
source: Schedule name
ar: اسم الفترة
fr: Nom de la plage

# admin.hh_schedules_header
source: Time slots
ar: الفترات الزمنية
fr: Plages horaires

# admin.hh_select_all_rules
source: Select all
ar: تحديد الكل
fr: Tout sélectionner

# admin.hh_selected_count %lld
source: %lld selected
ar: %lld محدد
fr: %lld sélectionné(s)

# admin.hh_start_label
source: Start
ar: البداية
fr: Début

# admin.hh_tab_families
source: Families
ar: الفئات
fr: Familles

# admin.hh_tab_label
source: Tab
ar: التبويب
fr: Onglet

# admin.hh_tab_products
source: Items
ar: الأصناف
fr: Articles

# admin.hh_tab_rules
source: Active rules
ar: القواعد النشطة
fr: Règles actives

# admin.hh_takeaway_included
source: takeaway included
ar: السفري مشمول
fr: emporté inclus

# admin.host_label
source: Host
ar: المضيف
fr: Hôte

# admin.identifier_label
source: Identifier
ar: المعرّف
fr: Identifiant

# admin.inactive_badge
source: Inactive
ar: غير نشط
fr: Inactif

# admin.ip_address_placeholder
source: IP address
ar: عنوان IP
fr: Adresse IP

# admin.item_section
source: Item
ar: الصنف
fr: Article

# admin.kitchen_ticket_language
source: Kitchen ticket language
ar: لغة تذاكر المطبخ
fr: Langue des bons cuisine

# admin.kpi_average_cover
source: Average / cover
ar: المتوسط / شخص
fr: Moyenne / couvert

# admin.kpi_average_order
source: Average order
ar: متوسط الطلب
fr: Ticket moyen

# admin.kpi_covers_count %lld
source: %lld cover(s)
ar: %lld شخص
fr: %lld couvert(s)

# admin.kpi_orders_count %lld
source: %lld order(s)
ar: %lld طلب
fr: %lld commande(s)

# admin.kpi_sales_ht %@
source: excl. tax ⁦%@⁩
ar: دون الضريبة ⁦%@⁩
fr: HT ⁦%@⁩

# admin.kpi_sales_ttc
source: Revenue incl. tax
ar: الإيرادات شاملة الضريبة
fr: Chiffre d'affaires TTC

# admin.last_sync_label
source: Last sync
ar: آخر مزامنة
fr: Dernière synchro

# admin.latency_label
source: Latency
ar: زمن الاستجابة
fr: Latence

# admin.new_category
source: New family
ar: فئة جديدة
fr: Nouvelle famille

# admin.new_page
source: New page
ar: صفحة جديدة
fr: Nouvelle page

# admin.new_pin_placeholder
source: New PIN (leave blank to keep)
ar: رمز PIN جديد (اتركه فارغًا للإبقاء عليه)
fr: Nouveau PIN (laisser vide pour conserver)

# admin.new_printer
source: New printer
ar: طابعة جديدة
fr: Nouvelle imprimante

# admin.new_product
source: New item
ar: صنف جديد
fr: Nouvel article

# admin.new_staff
source: New employee
ar: موظف جديد
fr: Nouvel employé

# admin.no_activity
source: No activity
ar: لا يوجد نشاط
fr: Aucune activité

# admin.no_payments
source: No payments
ar: لا توجد مدفوعات
fr: Aucun encaissement

# admin.no_sales
source: No sales
ar: لا توجد مبيعات
fr: Aucune vente

# admin.open_cash_drawer_toggle
source: Opens the cash drawer
ar: يفتح درج النقود
fr: Ouvre le tiroir-caisse

# admin.options_count %lld
source: %lld option(s)
ar: %lld خيار

# admin.page_chip %lld
source: Page %lld
ar: صفحة %lld

# admin.paper_width_label
source: Paper width
ar: عرض الورق
fr: Largeur papier

# admin.payment_methods_title
source: Payment methods
ar: طرق الدفع
fr: Moyens de paiement

# admin.pending_label
source: Pending
ar: في الانتظار
fr: En attente

# admin.pending_messages %lld
source: %lld message(s)
ar: %lld رسالة

# admin.period_label
source: Period
ar: الفترة
fr: Période

# admin.pin_code_placeholder %lld
source: PIN code (%lld digits)
ar: رمز PIN (%lld أرقام)
fr: Code PIN (%lld chiffres)

# admin.port_stepper %lld
source: Port %lld
ar: المنفذ %lld

# admin.preparation_section
source: Preparation
ar: التحضير
fr: Préparation

# admin.price_ttc_placeholder
source: Price incl. tax (€)
ar: السعر شامل الضريبة (€)
fr: Prix TTC (€)

# admin.print_job_cancel
source: Cancel
ar: إلغاء
fr: Annuler

# admin.print_job_kind_kitchenticket
source: Kitchen ticket
ar: تذكرة المطبخ
fr: Bon cuisine

# admin.print_job_kind_pickupvoucher
source: Pickup voucher
ar: قسيمة الاستلام
fr: Bon de retrait

# admin.print_job_kind_receipt
source: Receipt
ar: الإيصال
fr: Ticket de caisse

# admin.print_job_kind_report
source: Report
ar: تقرير
fr: Rapport

# admin.print_job_retry
source: Retry
ar: إعادة المحاولة
fr: Relancer

# admin.printer_jobs_btn
source: Print jobs
ar: مهام الطباعة
fr: Impressions

# admin.printer_pending %lld
source: %lld pending
ar: %lld قيد الانتظار
fr: %lld en attente

# admin.printer_section
source: Printer
ar: الطابعة
fr: Imprimante

# admin.printer_status_offline_since %@
source: Offline since %@
ar: غير متصلة منذ %@
fr: Hors ligne depuis %@

# admin.printer_status_online
source: Online
ar: متصلة
fr: En ligne

# admin.printer_status_unknown
source: Status unknown
ar: الحالة غير معروفة
fr: État inconnu

# admin.printer_text_mode
source: Text mode (fr/en, faster)
ar: وضع النص (فرنسي/إنجليزي، أسرع)
fr: Mode texte (fr/en, plus rapide)

# admin.printer_text_mode_badge
source: Text
ar: نص
fr: Texte

# admin.quick_key_toggle
source: Quick key
ar: مفتاح سريع
fr: Touche rapide

# admin.realtime_label
source: Realtime (SignalR)
ar: مباشر (SignalR)
fr: Temps réel (SignalR)

# admin.receipt_language
source: Receipt language
ar: لغة الإيصالات
fr: Langue des tickets

# admin.receipt_language_hint
source: Printers that do not support Arabic must stay in English or French.
ar: الطابعات التي لا تدعم العربية يجب أن تبقى بالإنجليزية أو الفرنسية.
fr: Une imprimante qui ne gère pas l'arabe doit rester en anglais ou en français.

# admin.reset_button
source: Reset
ar: إعادة تعيين
fr: Réinitialiser

# admin.role_label
source: Role
ar: الدور
fr: Rôle

# admin.rows_stepper %lld
source: Rows %lld
ar: الصفوف %lld
fr: Lignes %lld

# admin.search_placeholder
source: Search
ar: بحث
fr: Rechercher

# admin.search_product_prompt
source: Search an item
ar: البحث عن صنف
fr: Rechercher un article

# admin.section_catalog
source: Catalog
ar: الكتالوج
fr: Catalogue

# admin.section_dashboard
source: Dashboard
ar: لوحة المعلومات
fr: Tableau de bord

# admin.section_grid
source: Touch grid
ar: الشبكة اللمسية
fr: Grille tactile

# admin.section_network
source: Network & terminal
ar: الشبكة والصندوق
fr: Réseau & terminal

# admin.section_printers
source: Printers
ar: الطابعات
fr: Imprimantes

# admin.section_staff
source: Staff
ar: الفريق
fr: Équipe

# admin.select_all_button
source: All
ar: الكل
fr: Tout

# admin.select_none_button
source: None
ar: لا شيء
fr: Aucun

# admin.served_stations_section
source: Served stations
ar: الأقسام المخدومة
fr: Postes desservis

# admin.service_summary %lld %lld
source: %lld order(s) · %lld cover(s)
ar: %lld طلب · %lld شخص
fr: %lld commande(s) · %lld couvert(s)

# admin.services_title
source: Services
ar: الخدمات

# admin.slot_product_label
source: Item
ar: الصنف
fr: Article

# admin.slot_title %lld%lld
source: Slot R%lld · C%lld
ar: الخانة ص%lld · ع%lld
fr: Case L%lld · C%lld

# admin.staff_productivity_title
source: Server productivity
ar: إنتاجية النُدُل
fr: Productivité serveurs

# admin.staff_summary %lld %@
source: %lld table(s) · avg. ⁦%@⁩
ar: %lld طاولة · المتوسط ⁦%@⁩
fr: %lld table(s) · moy. ⁦%@⁩

# admin.station_default_hot
source: Hot kitchen (default)
ar: المطبخ الساخن (افتراضي)
fr: Cuisine chaude (défaut)

# admin.station_from_category
source: Category station
ar: محطة الفئة
fr: Poste de la famille

# admin.station_label
source: Station
ar: القسم
fr: Poste

# admin.status_label
source: Status
ar: الحالة
fr: État

# admin.sync_section
source: Sync (outbox queue)
ar: المزامنة (قائمة Outbox)
fr: Synchronisation (file Outbox)

# admin.synced_label
source: Synced
ar: تمت مزامنتها
fr: Synchronisés

# admin.synced_transactions %lld
source: %lld transaction(s)
ar: %lld معاملة

# admin.terminal_section
source: Terminal
ar: الصندوق

# admin.test_button
source: Test
ar: اختبار

# admin.theme_label
source: Theme
ar: السمة
fr: Thème

# admin.tile_color_label
source: Tile color
ar: لون المربع
fr: Couleur de la tuile

# admin.top_sales_title
source: Best sellers
ar: الأكثر مبيعًا
fr: Meilleures ventes

# admin.version_label
source: Version
ar: الإصدار

# admin.voucher_overflow_label
source: Meal vouchers: overflow
ar: قسائم الوجبات: التجاوز
fr: Titres-restaurant : dépassement

# common.cancel
source: Cancel
ar: إلغاء
fr: Annuler

# common.clear
source: Clear
ar: مسح
fr: Effacer

# common.close_label
source: Close
ar: إغلاق
fr: Fermer

# common.delete
source: Delete
ar: حذف
fr: Supprimer

# common.field_name
source: Name
ar: الاسم
fr: Nom

# common.field_server
source: Server
ar: الخادم
fr: Serveur

# common.field_terminal
source: Terminal
ar: الصندوق

# common.happy_hour_active_subtitle
source: Preferential rates active
ar: أسعار تفضيلية سارية
fr: Tarifs préférentiels actifs

# common.happy_hour_extend_30
source: +30 min
ar: +30 دقيقة

# common.happy_hour_force_60
source: Force 1 h
ar: فرض ساعة
fr: Forcer 1 h

# common.happy_hour_override_button
source: Override
ar: استثناء
fr: Dérogation

# common.happy_hour_override_pin_hint
source: Manager PIN code required
ar: يلزم رمز PIN لمسؤول
fr: Code PIN d'un responsable requis

# common.happy_hour_override_subtitle
source: Reduced rates forced by a manager
ar: أسعار مخفّضة مفروضة من مسؤول
fr: Tarifs réduits forcés par un responsable

# common.happy_hour_override_title
source: Happy Hour Override
ar: استثناء Happy Hour
fr: Dérogation Happy Hour

# common.happy_hour_reason_placeholder
source: Reason (optional)
ar: السبب (اختياري)
fr: Motif (facultatif)

# common.happy_hour_stop
source: Stop
ar: إيقاف
fr: Arrêter

# common.invalid_address
source: Invalid address
ar: عنوان غير صالح
fr: Adresse invalide

# common.keypad_clear
source: Clear all
ar: مسح الكل
fr: Tout effacer

# common.keypad_decimal
source: Decimal point
ar: الفاصلة العشرية
fr: Virgule

# common.keypad_delete
source: Delete
ar: حذف
fr: Effacer

# common.master_server_section
source: Master server
ar: الخادم الرئيسي
fr: Serveur maître

# common.nav_admin
source: Admin
ar: الإدارة
fr: Gestion

# common.nav_connection
source: Connection
ar: الاتصال
fr: Connexion

# common.nav_fiscal
source: Closure
ar: الإقفال
fr: Clôture

# common.nav_floor
source: Floor
ar: الصالة
fr: Salle

# common.nav_kitchen
source: Kitchen
ar: المطبخ
fr: Cuisine

# common.nav_lock
source: Lock
ar: قفل
fr: Verrouiller

# common.nav_order
source: Order
ar: الصندوق
fr: Caisse

# common.pairing_camera_unavailable
source: Camera unavailable: enter the code manually.
ar: الكاميرا غير متاحة: أدخل الرمز يدويًا.
fr: Caméra indisponible : saisissez le code manuellement.

# common.pairing_cannot_reach %@
source: Could not reach “%@”
ar: تعذّر الوصول إلى «%@»
fr: Impossible de joindre « %@ »

# common.pairing_code_placeholder
source: Pairing code
ar: رمز الاقتران
fr: Code d'appairage

# common.pairing_discovered_servers
source: Servers found
ar: الخوادم التي تم العثور عليها
fr: Serveurs trouvés

# common.pairing_hint
source: Generate a code in Management → Devices on the manager's station.
ar: أنشئ رمزًا في الإدارة ← الأجهزة على جهاز المسؤول.
fr: Générez un code dans Gestion → Appareils sur le poste du responsable.

# common.pairing_manual_entry_section
source: Manual entry
ar: الإدخال اليدوي
fr: Saisie manuelle

# common.pairing_nav_title
source: Pairing
ar: الاقتران
fr: Appairage

# common.pairing_qr_not_recognized
source: QR code not recognized
ar: لم يتم التعرف على رمز QR
fr: QR non reconnu

# common.pairing_register_failed
source: Could not register the iPad's identity. Try again with a new code.
ar: تعذّر تسجيل هوية iPad. أعد المحاولة برمز جديد.
fr: Impossible d'enregistrer l'identité de l'iPad. Réessayez avec un nouveau code.

# common.pairing_scan_qr
source: Scan the back-office QR code
ar: امسح رمز QR من الإدارة الخلفية
fr: Scanner le QR du back-office

# common.pairing_searching_network
source: Searching the local network…
ar: جارٍ البحث في الشبكة المحلية…
fr: Recherche sur le réseau local…

# common.pairing_submit_button
source: Pair this iPad
ar: إقران هذا iPad
fr: Appairer cet iPad

# common.pin_dots_value %lld %lld
source: %lld of %lld
ar: %lld من %lld
fr: %lld sur %lld

# common.refresh_label
source: Refresh
ar: تحديث
fr: Actualiser

# common.save
source: Save
ar: حفظ
fr: Enregistrer

# common.server_reachable %lld
source: ✓ Server reachable (%lld ms)
ar: ✓ الخادم متاح (%lld ms)
fr: ✓ Serveur joignable (%lld ms)

# common.status_offline
source: Offline
ar: غير متصل
fr: Hors ligne

# common.status_online %@
source: Online · %@
ar: متصل · %@
fr: En ligne · %@

# common.status_online_simple
source: Online
ar: متصل
fr: En ligne

# common.test_connection
source: Test connection
ar: اختبار الاتصال
fr: Tester la connexion

# common.this_ipad_section
source: This iPad
ar: هذا iPad
fr: Cet iPad

# common.unpair_ipad
source: Unpair this iPad
ar: إلغاء إقران هذا iPad
fr: Dissocier cet iPad

# fiscal.confirm_z_button
source: Close and seal the day
ar: إقفال اليوم وختمه
fr: Clôturer et sceller la journée

# fiscal.confirm_z_dialog_title
source: Run the Z closure?
ar: تنفيذ إقفال Z؟
fr: Exécuter la clôture Z ?

# fiscal.confirm_z_message
source: Irreversible operation: sales for the period are sealed (NF525).
ar: عملية لا رجعة فيها: تُختم مبيعات الفترة (NF525).
fr: Opération irréversible : les ventes de la période sont scellées (NF525).

# fiscal.execute_z_button
source: Daily Z closure
ar: إقفال Z اليومي
fr: Clôture Z du jour

# fiscal.fec_export_title
source: FEC accounting export
ar: التصدير المحاسبي FEC
fr: Export comptable FEC

# fiscal.fec_from
source: From
ar: من
fr: Du

# fiscal.fec_to
source: To
ar: إلى
fr: Au

# fiscal.generate_fec_button
source: Generate FEC
ar: إنشاء FEC
fr: Générer le FEC

# fiscal.preview_x_button
source: X report preview
ar: معاينة تقرير X
fr: Aperçu rapport X

# fiscal.print_x_report
source: Print X report
ar: طباعة تقرير X
fr: Imprimer le rapport X

# fiscal.reports_title
source: Cash register reports
ar: تقارير الصندوق
fr: Rapports de caisse

# fiscal.reprint_z
source: Reprint last closure
ar: إعادة طباعة آخر إغلاق
fr: Réimprimer la dernière clôture

# fiscal.share_file %@
source: Share %@
ar: مشاركة %@
fr: Partager %@

# fiscal.slip_date_label
source: Date
ar: التاريخ

# fiscal.slip_hash_pending
source: GENERATED AT Z CLOSURE
ar: يُنشأ عند إقفال Z
fr: GÉNÉRÉE À LA CLÔTURE Z

# fiscal.slip_perpetual_label
source: Perpetual grand total
ar: الإجمالي العام الدائم
fr: Grand total perpétuel

# fiscal.slip_sealed_status
source: Fiscal audit chain sealed and valid (NF525)
ar: سلسلة التدقيق الضريبي مختومة وصالحة (NF525)
fr: Chaîne d'audit fiscale scellée et valide (NF525)

# fiscal.slip_signature_label
source: Signature
ar: التوقيع

# fiscal.slip_tickets_label
source: Receipts
ar: الإيصالات
fr: Tickets

# fiscal.slip_title_x
source: *** CURRENT FINANCIAL REPORT — X REPORT ***
ar: *** التقرير المالي الجاري — تقرير X ***
fr: *** RAPPORT FINANCIER EN COURS — RAPPORT X ***

# fiscal.slip_title_z %lld
source: *** DAILY CLOSURE — Z REPORT #%lld ***
ar: *** الإقفال اليومي — تقرير Z رقم %lld ***
fr: *** CLÔTURE JOURNALIÈRE — RAPPORT Z n°%lld ***

# fiscal.slip_total_ht_label
source: Total excl. tax
ar: الإجمالي دون الضريبة
fr: Total HT

# fiscal.slip_total_ttc_label
source: TOTAL incl. tax
ar: الإجمالي شامل الضريبة
fr: TOTAL TTC

# fiscal.slip_unsealed_status
source: Live service data (not sealed)
ar: بيانات الخدمة المباشرة (غير مختومة)
fr: Données en direct du service (non scellées)

# fiscal.x_z_explanation
source: The X report is a live, unsealed preview. The Z closure seals the day with SHA-256 chaining and resets the counters.
ar: تقرير X معاينة مباشرة غير مختومة. إقفال Z يختم اليوم بتسلسل SHA-256 ويعيد العدادات إلى الصفر.
fr: Le rapport X est un aperçu en direct, non scellé. La clôture Z scelle la journée par chaînage SHA-256 et remet les compteurs à zéro.

# floor.add_table
source: New table
ar: طاولة جديدة
fr: Nouvelle table

# floor.capacity_stepper %lld
source: Capacity: %lld people
ar: السعة: %lld أشخاص
fr: Capacité : %lld personnes

# floor.covers_count
source: Number of covers
ar: عدد الأشخاص
fr: Nombre de couverts

# floor.create_table
source: Create table
ar: إنشاء الطاولة
fr: Créer la table

# floor.filter_all
source: All
ar: الكل
fr: Toutes

# floor.filter_bill
source: Bill
ar: الفاتورة
fr: Addition

# floor.filter_free
source: Free
ar: شاغرة
fr: Libres

# floor.filter_occupied
source: Occupied
ar: مشغولة
fr: Occupées

# floor.kpi_occupied_tables
source: Occupied tables
ar: الطاولات المشغولة
fr: Tables occupées

# floor.kpi_open_total
source: In progress
ar: جارية
fr: En cours

# floor.new_table_title
source: New table
ar: طاولة جديدة
fr: Nouvelle table

# floor.number_placeholder
source: Number or name (e.g. T9, Terrace 1)
ar: الرقم أو الاسم (مثال: T9، التراس 1)
fr: Numéro ou nom (ex. T9, Terrasse 1)

# floor.open_table_subtitle %lld
source: Capacity %lld people
ar: السعة %lld أشخاص
fr: Capacité %lld personnes

# floor.open_table_title %@
source: Open table %@
ar: فتح الطاولة %@
fr: Ouvrir la table %@

# floor.open_with_covers %lld
source: Open with %lld cover(s)
ar: فتح بـ %lld شخص
fr: Ouvrir avec %lld couvert(s)

# floor.table_capacity %@%lld%@
source: %@%lld guests%@
ar: %@%lld أشخاص%@
fr: %@%lld pers.%@

# floor.tap_to_open
source: Tap to open
ar: المس للفتح
fr: Touchez pour ouvrir

# kitchen.filter_all_stations
source: All stations
ar: كل الأقسام
fr: Tous les postes

# kitchen.readonly_notice
source: Read only: only the kitchen and managers can advance tickets.
ar: للقراءة فقط: المطبخ والمسؤولون فقط يمكنهم تحديث حالة التذاكر.
fr: Lecture seule : seuls la cuisine et les responsables font avancer les bons.

# kitchen.updated_at %@
source: Updated %@
ar: آخر تحديث %@
fr: Mis à jour %@

# login.change_server
source: Change
ar: تغيير
fr: Changer

# login.demo_mode_label
source: Demo mode (local data)
ar: الوضع التجريبي (بيانات محلية)
fr: Mode démo (données locales)

# login.enter_pin_subtitle
source: Enter your PIN code
ar: أدخل رمز PIN
fr: Saisissez votre code PIN

# login.locked_title
source: Terminal locked
ar: الصندوق مقفل
fr: Caisse verrouillée

# order.add_as_dessert
source: Add as Dessert
ar: إضافة كحلوى
fr: Ajouter en Dessert

# order.add_as_suite
source: Add as Next Course
ar: إضافة كطبق تالٍ
fr: Ajouter en Suite

# order.add_to_ticket_button
source: Add to ticket
ar: إضافة إلى التذكرة
fr: Ajouter au ticket

# order.all_menu
source: Full menu
ar: القائمة كاملة
fr: Tout le menu

# order.already_paid_label
source: Already paid
ar: مدفوع مسبقًا
fr: Déjà réglé

# order.apply_discount_button
source: Apply discount
ar: تطبيق الخصم
fr: Appliquer la remise

# order.clear_action
source: Clear
ar: إفراغ
fr: Vider

# order.comp_badge
source: Comped
ar: مجاني
fr: Offert

# order.comp_item_button
source: Comp the item
ar: تقديم الصنف مجانًا
fr: Offrir l'article

# order.confirm_void_button
source: Confirm cancellation
ar: تأكيد الإلغاء
fr: Confirmer l'annulation

# order.counter_label
source: Counter
ar: الكاونتر
fr: Comptoir

# order.covers_count %lld
source: %lld cover(s)
ar: %lld شخص
fr: %lld couvert(s)

# order.custom_reason_placeholder
source: Specify the reason
ar: حدّد السبب
fr: Précisez le motif

# order.customize
source: Customize…
ar: تخصيص…
fr: Personnaliser…

# order.default_customer_label
source: Customer
ar: زبون
fr: Client

# order.destination_eat_in
source: Eat in
ar: في المطعم
fr: Sur place

# order.destination_label
source: Destination
ar: الوجهة

# order.destination_takeaway
source: Takeaway
ar: سفري
fr: À emporter

# order.dine_in_label
source: Dine in
ar: في المطعم
fr: Sur place
